 //Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

//6 -> да
//7 -> да
//1 -> нет

Console.Clear();
Console.Write("Введите  цифру, обозначающую день недели: ");
int den;
den = int.Parse(Console.ReadLine());



if ((den>7)|| (den<1)) {Console.Write("ты че такое ввел?)");}
else{

if((den==6)||(den==7)) {Console.Write("это выходной, иди пить пиво");}
else{{Console.Write("это будний день, иди на работу");}}

}